
//prev mail, not sendable
let mail_pre_1 = {
  io: 'in',
  date: '2019/10/29 8:57 AM',
  title: '[고객۰네트워크 협력실] 오늘자 검사 자료입니다.',
  content: '오늘 검사해야 할 자료들입니다.<br/>우리 고객들의 소중한 정보입니다. 모종의 이유로 정보가 변경되지는 않았는지 검사기 프로그램을 통해 검사해주세요.<br/><br/>검사가 끝나면 검사한 파일들을 첨부하여 <strong>제 메일</strong>로 보내주세요.<br/><br/><strong>주의2 : 파일을 첨부하여 메일을 보내면 해당 첨부파일은 자동으로 삭제됩니다.</strong><br/><br/>고객۰네트워크과장<br/>쑨 이저우',
  attatch: [edf_mail_pre_1_1, edf_mail_pre_1_2, edf_mail_pre_1_3]
}

let mail_pre_2 = {
  io: 'in',
  date: '2019/10/28 5:57 PM',
  title: '[정보보안실] 주의! 최근 보안 침입 시도가 급증하고 있음.',
  content: '최근 며칠 사이에 외부에서 회사 인트라넷에 접근해 침입하려는 시도가 발견되고 있습니다.<br/>이는 보안상 큰 위험을 초래할 수도 있습니다.<br/>각 부서의 사원들은 정보보안에 각별한 주의를 기울여주시기 바랍니다.<br/><br/>또한, 컴퓨터에 미묘한 변화가 생겼거나 불순한 낌새를 발견한 사원은<br/>즉시 정보보안실(☎02-880-0044)로 연락해주시기 바랍니다.<br/><br/>정보보안실장<br/>티에리 마르티네즈.<br/><br/>* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

let mail_pre_3 = {
  io: 'in',
  date: '2019/10/25 3:22 PM',
  title: '요즘 눈이 너무 안 좋아진 것 같다고?',
  content: '어이, 친구!<br /><br />매일 같이 산더미 같은 텍스트를 읽으려고 하니까 그러지!<br /><br />읽으려고 하지 말게나. 눈은 소중해.<br /><br />나는 오늘부터 휴가네. 돌아왔을 때, 같이 술이나 한 잔 하세.',
  attatch: []
}

let mail_pre_4 = {
  io: 'in',
  date: '2019/06/28 9:27 AM',
  title: '[사업부] 승진을 축하하네.',
  content: '잘 지내시는가, 사업부장이라네.<br /><br />이번 6월 최고임원회의에서 자네의 승진이 결정되었다네.<br /><br />부서와 업무에 대해서는 아래 전달 사항을 보게나.<br /><br />언제 어디서든 맡은 바 임무를 잘 수행하기를 비네.<br /><br />사업부장<br />아카토시 오오츠노미야<br />---------------------------------------------------------------------------------------<br />FW : [인재경영실] 19년 7월 승진 현황 및 업무 배정 보고드립니다.<br />보낸 사람 : 아드리안 로하스 카르데나스<br />보낸 날짜 : 2019/06/26 09:00 AM<br /><br />사업부장님께 19년 7월 승진 현황 및 업무 배정 보고드리겠습니다.<br />차장 2명, 과장 1명, 대리 2명으로 총 5명이 승진 명단에 들었습니다.<br /><br />해당 목록과 업무 배정은 다음과 같습니다.<br /><br />1. 경영부<br />- 프레드 마틴 : 차장 / 회사의 원활한 운영을 위해 내부 경영을 지원하는 업무.<br /><br />2. 사업부<br />- 톰 마렛 : 과장 / 고객과 고객 사이의 인터랙션 중 컴퓨터의 오류로 EDF 파일이 변경되지는 않았는지 검사하여 사업의 개선률을 측정하는 업무.<br /><br />3. 고객부<br />- 로자 멘쉬코프 : 대리 / 보관되고 있는 VIP 고객들의 EDF 파일에 대한 외부 접근 여부를 검사하는 업무.<br /><br />4. 네트워크부<br />- 이 두일 : 차장 / 사내 네트워크 및 통신 네트워크 운용, 관리에 대해 전반적으로 관할하는 업무.<br />- 론 토마스 : 대리 / 서버 저장소에 외부의 침입이 발생하는지 감시۰검사하는 업무.<br /><br />* 푸스 가일은 네트워크 운용실장에서 네트워크 운용과장으로 강등당했음을 알려드립니다.<br /><br />입니다.<br /><br />해당 사안에 대해 부서원들께 전달 부탁드리겠습니다.<br />감사합니다.<br /><br />인재경영실장<br />아드리안 로하스 카르데나스<br />',
  attatch: []
}

let mail_pre_5 = {
  io: 'in',
  date: '2019/01/14 3:33 PM',
  title: '[직원교육실] 조직 구조 개편에 따른 안내 메일입니다.',
  content: '안녕하십니까, 직원교육실에서 알려드리겠습니다!<br/><br/>2019년 2월 1일부터 조직 구조가 다음과 같이 개편됩니다.<br/><br/> - CEO 산하의 윤리 센터가 신설됩니다.<br/> - (구)고객관리실I, II가 VIP 고객관리실, 글로벌고객관리실I, 글로벌고객관리실II로 분리됩니다.<br/> - (구)미디어 사업실이 미디어 사업실과 SNP 사업실로 분리됩니다.<br/> - 홍보실이 사업부에서 고객부로 이전합니다.<br/><br/>이로 인한 조직 구조는 회사 홈페이지의 "조직도"를 참고해주시기 바랍니다.<br/><br/>감사합니다.<br/><br/>۰ 또한, 회사 홈페이지 개편도 이루어졌으므로 한 번 찬찬히 보시길 부탁드립니다.<br/><br/>직원교육실 직원공지 담당<br/>임 용덕<br/><br/>* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

let mail_pre_6 = {
  io: 'in',
  date: '2019/09/04 1:38 PM',
  title: '[감사실] 19년 2분기 사내 만족도 조사 결과',
  content: '감사실에서 안내해드립니다.<br /><br />지난 번, 과장급 이상을 대상으로 시행했던 19년 2분기 사내 만족도 조사 결과가 나왔습니다.<br /><br />만족 68명, 불만족 1명으로 만족률 98.55%입니다.<br /><br />CEO님께서는 모두가 만족하는 회사가 될 수 있도록 더욱 분발하라고 하셨습니다.<br /><br />감사합니다.<br /><br />추신 : 불만족을 표한 푸스 가일 과장은 감사실로 와서 어떤 점이 개선되었으면 하는지 이야기해주시기 바랍니다.<br/>--------------------------------------------------------------------------------<br/>상세결과입니다.<br/><table><thead><tr><th>부서</th><th>사무실</th><th>직급</th><th>사원번호</th><th>만족도 여부</th></tr></thead><tbody><tr><td>-</td><td>-</td><td>CEO</td><td>FM5791</td><td>만족</td></tr><tr><td>-</td><td>감사실</td><td>이사</td><td>OG4891</td><td>만족</td></tr><tr><td>-</td><td>감사실</td><td>부장</td><td>VI4162</td><td>만족</td></tr><tr><td>-</td><td>비서실</td><td>이사</td><td>PP4181</td><td>만족</td></tr><tr><td>-</td><td>비서실</td><td>이사</td><td>RV8691</td><td>만족</td></tr><tr><td>-</td><td>비서실</td><td>이사</td><td>SC0561</td><td>만족</td></tr><tr><td>-</td><td>비서실</td><td>부장</td><td>QO7593</td><td>만족</td></tr><tr><td>경영부</td><td>-</td><td>부장</td><td>NL7211</td><td>만족</td></tr><tr><td>경영부</td><td>인재경영실</td><td>차장</td><td>SX8973</td><td>만족</td></tr><tr><td>경영부</td><td>인재경영실</td><td>과장</td><td>QQ9741</td><td>만족</td></tr><tr><td>경영부</td><td>인재경영실</td><td>과장</td><td>LJ1026</td><td>만족</td></tr><tr><td>경영부</td><td>직원교육실</td><td>차장</td><td>SV0327</td><td>만족</td></tr><tr><td>경영부</td><td>직원교육실</td><td>과장</td><td>BK8628</td><td>만족</td></tr><tr><td>경영부</td><td>대외정책연구실</td><td>차장</td><td>YQ6494</td><td>만족</td></tr><tr><td>경영부</td><td>대외정책연구실</td><td>과장</td><td>EO9926</td><td>만족</td></tr><tr><td>경영부</td><td>대외정책연구실</td><td>과장</td><td>IP9428</td><td>만족</td></tr><tr><td>경영부</td><td>대외정책연구실</td><td>과장</td><td>FP3634</td><td>만족</td></tr><tr><td>경영부</td><td>재무실</td><td>차장</td><td>DH6983</td><td>만족</td></tr><tr><td>경영부</td><td>경영지원실</td><td>차장</td><td>IJ2023</td><td>만족</td></tr><tr><td>사업부</td><td>-</td><td>부장</td><td>JX0780</td><td>만족</td></tr><tr><td>사업부</td><td>SNP 사업실</td><td>차장</td><td>SA6567</td><td>만족</td></tr><tr><td>사업부</td><td>SNP 사업실</td><td>과장</td><td>TF0022</td><td>만족</td></tr><tr><td>사업부</td><td>미디어 사업실</td><td>차장</td><td>VF2771</td><td>만족</td></tr><tr><td>사업부</td><td>미디어 사업실</td><td>과장</td><td>EF9796</td><td>만족</td></tr><tr><td>사업부</td><td>정부협력사업실</td><td>차장</td><td>GN7541</td><td>만족</td></tr><tr><td>사업부</td><td>정부협력사업실</td><td>과장</td><td>JR2653</td><td>만족</td></tr><tr><td>사업부</td><td>정부협력사업실</td><td>과장</td><td>HI7632</td><td>만족</td></tr><tr><td>사업부</td><td>정부협력사업실</td><td>과장</td><td>OD6828</td><td>만족</td></tr><tr><td>사업부</td><td>전략기획실</td><td>차장</td><td>ZC9873</td><td>만족</td></tr><tr><td>사업부</td><td>전략기획실</td><td>과장</td><td>XH9893</td><td>만족</td></tr><tr><td>고객부</td><td>-</td><td>부장</td><td>MR3081</td><td>만족</td></tr><tr><td>고객부</td><td>VIP고객관리실</td><td>차장</td><td>KI6153</td><td>만족</td></tr><tr><td>고객부</td><td>VIP고객관리실</td><td>과장</td><td>QQ3878</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실I</td><td>차장</td><td>LU1513</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실I</td><td>과장</td><td>RT1486</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실I</td><td>과장</td><td>RC1503</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실I</td><td>과장</td><td>YB8101</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실II</td><td>차장</td><td>SK4555</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실II</td><td>과장</td><td>XI6976</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실II</td><td>과장</td><td>AD0307</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실II</td><td>과장</td><td>RY5382</td><td>만족</td></tr><tr><td>고객부</td><td>글로벌고객관리실II</td><td>과장</td><td>TT8356</td><td>만족</td></tr><tr><td>고객부</td><td>고객지원실</td><td>차장</td><td>XM0525</td><td>만족</td></tr><tr><td>고객부</td><td>고객지원실</td><td>과장</td><td>QI4477</td><td>만족</td></tr><tr><td>고객부</td><td>마케팅전략실</td><td>차장</td><td>ID7982</td><td>만족</td></tr><tr><td>고객부</td><td>마케팅전략실</td><td>과장</td><td>JL2011</td><td>만족</td></tr><tr><td>고객부</td><td>마케팅전략실</td><td>과장</td><td>PH0453</td><td>만족</td></tr><tr><td>고객부</td><td>마케팅전략실</td><td>과장</td><td>PO8240</td><td>만족</td></tr><tr><td>고객부</td><td>홍보실</td><td>차장</td><td>AQ4535</td><td>만족</td></tr><tr><td>고객부</td><td>홍보실</td><td>과장</td><td>CZ3261</td><td>만족</td></tr><tr><td>고객부</td><td>홍보실</td><td>과장</td><td>HF6458</td><td>만족</td></tr><tr><td>고객부</td><td>홍보실</td><td>과장</td><td>JV8327</td><td>만족</td></tr><tr><td>고객부</td><td>홍보실</td><td>과장</td><td>DU7043</td><td>만족</td></tr><tr><td>네트워크부</td><td>-</td><td>부장</td><td>AI8247</td><td>만족</td></tr><tr><td>네트워크부</td><td>네트워크 연구소</td><td>수석 연구원</td><td>EX3411</td><td>만족</td></tr><tr><td>네트워크부</td><td>네트워크 운용실</td><td>차장</td><td>ZG9795</td><td>만족</td></tr><tr><td>네트워크부</td><td>네트워크 운용실</td><td>과장</td><td>CH5588</td><td>만족</td></tr><tr><td>네트워크부</td><td>네트워크 운용실</td><td>과장</td><td>TLUC814</td><td>불만족</td></tr><tr><td>네트워크부</td><td>고객۰네트워크 협력실</td><td>차장</td><td>PQ2806</td><td>만족</td></tr><tr><td>네트워크부</td><td>고객۰네트워크 협력실</td><td>과장</td><td>SI5111</td><td>만족</td></tr><tr><td>네트워크부</td><td>정보보안실</td><td>차장</td><td>IV9249</td><td>만족</td></tr><tr><td>네트워크부</td><td>정보보안실</td><td>과장</td><td>IC7047</td><td>만족</td></tr><tr><td>네트워크부</td><td>서버 저장소</td><td>부장</td><td>IX1316</td><td>만족</td></tr><tr><td>기술서비스부</td><td>-</td><td>부장</td><td>DD3332</td><td>만족</td></tr><tr><td>기술서비스부</td><td>디바이스 기술 연구소</td><td>수석 연구원</td><td>EN2895</td><td>만족</td></tr><tr><td>기술서비스부</td><td>인터넷 서비스 연구소</td><td>수석 연구원</td><td>XH3522</td><td>만족</td></tr><tr><td>기술서비스부</td><td>응용 프로그램 연구소</td><td>수석 연구원</td><td>LH3861</td><td>만족</td></tr><tr><td>기술서비스부</td><td>기술지원실</td><td>차장</td><td>UH7049</td><td>만족</td></tr><tr><td>기술서비스부</td><td>기술지원실</td><td>과장</td><td>XQ1504</td><td>만족</td></tr></tbody></table><br /><br />감사실 사원감사 담당<br />루디 산체스<br /><br />* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

let mail_pre_7_1 = {
  io: 'in',
  date: '2019/05/31 5:14 PM',
  title: '[경영지원실] 6월 생월자 사무실 전화번호(과장급 이상)',
  content: '6월 과장급 이상 생월자 분들의 사무실 전화번호입니다 :)<br/>해당 날짜에 잊지말고 축하의 메세지 한 마디씩 부탁드립니다~<br/><br/>6.2 : 미디어 사업실장님(☎0022)<br/>6.5 : 마케팅 전략실장님(☎0035)<br/>6.8 : 재무실장님(☎0014)<br/>6.12 : 기술지원실장님(☎0054)<br/>6.15 : 인터넷 서비스 연구소장님(☎0052)<br/>6.25 : CSO 님(☎0001)<br/>6.29 : 사업계획과장(☎0024)<br/>6.30 : 비서실장님(☎0002)<br/><br/>경영지원실장<br/>프레드 마틴<br/><br/>* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

let mail_pre_7_2 = {
  io: 'in',
  date: '2019/06/28 5:27 PM',
  title: '[경영지원실] 7월 생월자 사무실 전화번호(과장급 이상)',
  content: '7월 과장급 이상 생월자 분들의 사무실 전화번호입니다 :)<br/>해당 날짜에 잊지말고 축하의 메세지 한 마디씩 부탁드립니다~<br/><br/>7.6 : 북아메리카 협력과장(☎0023)<br/>7.7 : 글로벌고객관리2실장님(☎0032)<br/>7.28 : 인트라넷 선임 연구원(☎0041)<br/>7.29 : 북아메리카 마케팅과장(☎0035), 네트워크 관리과장(☎0042)<br/><br/>경영지원실장<br/>프레드 마틴<br/><br/>* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

let mail_pre_7_3 = {
  io: 'in',
  date: '2019/07/31 6:4 PM',
  title: '[경영지원실] 8월 생월자 사무실 전화번호(과장급 이상)',
  content: '8월 과장급 이상 생월자 분들의 사무실 전화번호입니다 :)<br/>해당 날짜에 잊지말고 축하의 메세지 한 마디씩 부탁드립니다~<br/><br/>8.3 : 동남아시아 고객관리과장(☎0033)<br/>8.12 : 동아시아 고객관리과장(☎0033)<br/>8.20 : 남아메리카 정책연구과장(☎0013)<br/>8.24 : 소셜 네트워크과장(☎0021)<br/><br/>경영지원실장<br/>프레드 마틴<br/><br/>* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

let mail_pre_7_4 = {
  io: 'in',
  date: '2019/08/31 4:59 PM',
  title: '[경영지원실] 9월 생월자 사무실 전화번호(과장급 이상)',
  content: '9월 과장급 이상 생월자 분들의 사무실 전화번호입니다 :)<br/>해당 날짜에 잊지말고 축하의 메세지 한 마디씩 부탁드립니다~<br/><br/>9.4 : 아시아 홍보과장(☎0036)<br/>9.11 : 고객지원실장님(☎0034)<br/>9.23 : 정부협력사업실장님(☎0023), 기술지원과장(☎0054)<br/>9.25 : 오세아니아 고객관리과장(☎0033)<br/><br/>경영지원실장<br/>프레드 마틴<br/><br/>* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

let mail_pre_7_5 = {
  io: 'in',
  date: '2019/09/30 5:43 PM',
  title: '[경영지원실] 10월 생월자 사무실 전화번호(과장급 이상)',
  content: '10월 과장급 이상 생월자 분들의 사무실 전화번호입니다 :)<br/>해당 날짜에 잊지말고 축하의 메세지 한 마디씩 부탁드립니다~<br/><br/>10.3 : 모바일 디바이스 선임 연구원(☎0051)<br/>10.5 : 아시아 마케팅과장(☎0035)<br/>10.8 : 유럽 홍보과장(☎0036)<br/>10.9 : 미디어 사업과장(☎0022)<br/>10.13 : EDF 선임 연구원(☎0053)<br/>10.15 : CEO님(☎0000)<br/>10.16 : 사내 프로그램 선임 연구원(☎0053)<br/>10.19 : 중앙아메리카 고객관리과장(☎0032)<br/>10.26 : 북아메리카 고객관리과장(☎0032)<br/>10.29 : 아시아 정책연구과장(☎0013)<br/>10.30 : IoT 선임 연구원(☎0052)<br/>10.31 : 네트워크부장님(☎0040)<br/><br/>경영지원실장<br/>프레드 마틴<br/><br/>* 본 메일은 사내 대량 메일 시스템을 통해 발송된 메일입니다.',
  attatch: []
}

//m: sender (name, address), title, content, attatch

let mail_first_mail_1 = {
  sender: {
    name: 'IKEM',
    address: ''
  },
  title: '(광고)마감임박! ㈜IKEM AI 자율변형 의자 ☞선착순 2,341명☜ ※90% 초특가 세일※',
  content: '<strong>Administer</strong> Your World!<br /><br />언제까지 의자에 앉아서 똑같은 세상만을 바라보시겠습니까?<br />앉은 채로도 세상을 관리할 수 있는 방법,<br />그 <strong>해답의 열쇠</strong>를 당신에게 알려드리겠습니다.<br /><br />* 지금 <strong>당신의 사원번호</strong>로 접속하면 90% 폭탄 세일을 받으실 수 있습니다.<br /><br />● 당신의 생각대로 자유롭게 변형되는 최첨단 기술의 집약체, AI 의자 < IKEM W-R0n9>를 IKEM에서 선보입니다.<br /><br />[특징]<br />- 에어스킨 메쉬<br />- 높이 조절<br />- 의자 모드<br />- 침대 모드<br />- 디스플레이 모드<br /><br />* 해당 정보들은 모두 EDF의 형태로 저장됩니다.<br /><br />IKEM 1주년 기념으로 90% 초특가 세일하여 지금 구매하면 단 돈 980,400원!!<br /><br />선착순 단 2,341명! 지금 바로 주문하세요!',
  attatch: []
}

let mail_met_todo_3 = {
  sender: {
    name: '쑨 이저우',
    address: 'lairotut@ptnp.com'
  },
  title: '[고객۰네트워크 협력실] 보내주신 자료 감사합니다.',
  content: '감사합니다.<br/><br/>회사를 위해 열심히 일하시는 모습 보기 좋습니다.<br/><br/>이곳으로 오셔서 확인 도장을 받아가시기 바랍니다.<br/><br/>오실 때, 컴퓨터는 꼭 <strong>절전 모드</strong>로 바꾸고 와주세요.<br/><br/>고객۰네트워크과장<br/>쑨 이저우',
  attatch: []
}

let mail_missed_todo_3 = {
  sender: {
    name: '쑨 이저우',
    address: 'lairotut@ptnp.com'
  },
  title: '[고객۰네트워크 협력실] 검사한 자료를 빨리 보내주시기 바랍니다.',
  content: '이상하게 오늘은 일 처리가 느리시군요.<br/>어서 <strong>제 메일</strong>로 검사한 자료를 보내주시기 바랍니다.<br/><br/>고객۰네트워크과장<br/>쑨 이저우',
  attatch: []
}

let mail_admin_on_1 = {
  sender: {
    name: 'MIKE',
    address: '****@***********.***'
  },
  title: '거기 있는 너는 그렇게 멍청하진 않은 모양이네.',
  content: '많은 사람들에게 메시지를 보냈지만 여기까지 도달한 사람은 몇 없었는데.<br/>넌 시험에 통과했어. 즉, 나랑 같이 일할 기회를 얻었다는 거지 (+ㅅ+).<br/><br/>나를 뭐라 설명하면 좋을까? 음, 어떤 정부가 고용한 해커라고 생각하면 좋을 것 같아.<br/>나는 이 회사를 조사하고 있어.<br/>이 회사는 표면적으로는 통신사인 것처럼 보이지만... 네가 보기엔 어때? 어떤 회사인 것 같아?<br/><br/>나를 도우면 너에게 진실을 보여줄게.<br/>외부인인 나는 너의 도움이 필요해!<br/>우리 함께 비밀을 파헤치자! @==(ㅇㅅㅇ)@<br/><br/>좋아, 파트너가 되었으니까 단도직입적으로 이야기할게!<br/>정부는 이 회사의 CEO, <strong>제레미 푸코의 자료</strong>가 필요해.<br/>이 회사가 자행하고 있는 일을 막기 위해, 그를 사회적으로 매장할 수 있을만한 자료 말야!<br/>그렇지만 아쉽게도 그는 그런 자료를 남겨놓지 않아(눈물).<br/><br/>그런데 마침 최근에 그에게 반기를 든 사람이 있었던 모양이야(두둥).<br/>그도 아마 회사의 진실을 알게 되었던 거 아닐까 (? ㅅ ?)<br/>그 사람의 자료를 한 번 찾아봐줘! 그럼 조금 실마리를 잡을 수 있을거야!!<br/><br/>(*≧∀≦*)',
  attatch: []
}

let mail_admin_on_2 = {
  sender: {
    name: 'MIKE',
    address: '****@***********.***'
  },
  title: '혹시 뭘 해야할지 막막하니?',
  content: '내가 첨부파일을 하나 줄게! (๑╹ω╹๑ )<br/><br/>VPN.plg라고 외부 네트워크에 접속할 수 있게 해주는 플러그인이지!<br/><strong>이 플러그인을 Applications 폴더에 넣으면</strong>, 차후에 유용한 것들을 할 수 있다구~<br/>예를 들면… 인터넷 검색과 @ptnp.com을 제외한 주소로도 메일을 보낼 수 있다는 것?<br/><br/>일단, 다운로드 받아봐! 그러면 다음 할 일을 알려줄게 :)<br/><br/><strong>* 네가 하는 일을 막는 게 있다면, 그냥 다 지워버려!</strong><br/><br/>( ͡° ͜ʖ ͡°)͡°)',
  attatch: [plg_vpn.duplicate()]
}

let mail_after_vpn = {
  sender: {
    name: 'MIKE',
    address: '****@***********.***'
  },
  title: '오, 내 예상보다 빠른데?',
  content: '잘했어 잘했어~<br/><br/>이제 뭘 해야할까? 뭘 해야할 것 같아? 모르겠지?<br/>어쩔 수 없지, 알려줄게! <br/><br/>네가 승진한 뒤에 하던 일 있잖아. EDF 파일 검사였나?<br/><strong>그 검사기에는 다른 기능이 있다고 해.</strong><br/>그렇지만 그 기능을 사용하려면 <strong>버전 설정</strong>을 해야한다더군 ^오^<br/><br/><strong>인트라넷</strong>과 <strong>인터넷 검색</strong>을 이용해서 정보를 모아봐!<br/><br/>성공한 너의 모습 볼 수 있으면 좋겠다..<br/><br/>༼ つ ◕_◕ ༽つ',
  attatch: []
}

let mail_inspector_upgraded = {
  sender: {
    name: 'MIKE',
    address: '****@***********.***'
  },
  title: '이상한 기능이 생겼네~',
  content: '파일 해독?<br/>이게 무슨 기능일까?<br/>EDF 파일을 가지고 뭔가 할 수 있을 것 같은데...<br/>잘 모르겠다~(데헿)<br/><br/>그것보다 나도 놀고만 있지는 않았다고!<br/>아까 말했던 사람 있잖아? 반기를 들었다던 사람!<br/>그 사람, 자기 자료를 <strong>Network</strong>에 올려놨다는 소문이 있어!<br/>EDF를 엄청나게 많이 보관하는 곳인가 봐.<br/>나무를 감추려면 숲으로 가라고 했던가? <br/><br/>마침 네 컴퓨터에서도 Network에 접속할 수 있으니 한 번 가봐!<br/>へ(￣∇￣へ)<br/><br/><strong>* 비밀번호는 숨겨져 있겠지… Admin 계정 설명서를 참고해!</strong><br/><br/>٩(๑`^´๑)۶',
  attatch: []
}

let mail_after_br7993 = {
  sender: {
    name: 'MIKE',
    address: '****@***********.***'
  },
  title: '바로 그거야!',
  content: '드디어 찾았구나!<br/>(❁´▽`❁)<br/><br/>그래, 그게 바로 내가 찾던 제레미 푸코의 자료야!<br/>역시~ 난 너를 믿고 있었다구!<br/><br/>파일을 읽어보니까 어때?<br/>제레미 푸코의 실체에 대해 조금은 알게 되었어?<br/>이 회사는 이런 식으로 개인정보를 모아 이용하는 집단이었다구~<br/>이게 ‘진실’이야.<br/><br/>자, 어서 그 자료를 <strong>MIKE@poodle-mail.com으로 보내!</strong><br/>٩| ര ‿ ര |╯<br/><br/><strong>혹시라도 지워지면 지금까지의 내 노력이 물거품이 되니</strong> 지금 당장(+ㅅ+)!!<br/>보내기만 하면, 내가 이제 다 해결할테니까~<br/><br/>٩(θ‿θ)۶',
  attatch: []
}

let mail_promote_min5 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 당신 자신에 대해 생각해보세요.',
  content: '당신에게 이야기하는 사람들의 메일을 잘 살펴보는 건 어떨까요?',
  attatch: []
}

let mail_promote_min8 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 사람들은 이메일 주소를 만들 때, 많은 의미를 담기도 합니다.',
  content: '당신은 어떤가요?',
  attatch: []
}

//hints_by_request
let mail_GM_start = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 오늘도 안녕하신가요, PTNP의 과장님!',
  content: '도움이 필요하실 때는 문의하기 버튼을 눌러주세요.<br/>물론...언제까지나 제가 알려드릴 수는 없다는 사실도 기억해주세요!',
  attatch: []
}

let mail_GM_worker_1 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 오늘따라 무슨 일을 해야할지 모르시겠나요?',
  content: '과장님이 매일 하시던 일은 ‘오늘 할 일’에 적혀있어요.<br/><br/>하지만 문득 다른 일을 하고 싶으시다면 관리자 계정에 들어가보시는 건 어떨까요?',
  attatch: []
}

let mail_GM_worker_2 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 그나저나 이상하군요...',
  content: '현재는 사내 네트워크로 연결되어 있어서 사내 메일 주소로만 전송, 수신이 가능할텐데… <br/><br/>과장님이 받은 메일은 약간 이상하네요.',
  attatch: []
}
let mail_GM_worker_3 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 혹시 그거 아세요?',
  content: '보통 사람들의 경우, 이메일 주소에 다양한 정보를 담는다고 해요.<br/>그 정보는 별명이기도, 좋아하는 숫자이기도 하지요.<br/><br/>과장님의 경우에는 어떻게 지으셨나요?',
  attatch: []
}

let mail_GM_admin_1 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 다운이 안 되는 경우가 가끔 있죠',
  content: '저도 가끔 뭔가 다운로드 받으려고 할 때면 백신이 바이러스 취급을 하더라구요. 그런 거 아닌데, 어처구니가 없어서 정말.<br/><br/>요놈이 어디에 있지… 제 컴퓨터에서는 Applications에 있네요.',
  attatch: []
}

let mail_GM_admin_2 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 회사 제품에 대해서 정보가 필요하시다면...',
  content: '회사와 회사 서비스에 대한 정보를 알아내는데 가장 좋은 방법은 회사 홈페이지를 들어가보는 것이지요. 심지어 이 회사 홈페이지는 인트라넷의 메인 페이지네요!<br/><br/>누군가 열심히 만들었을 이 회사 홈페이지를 확인해보세요.',
  attatch: []
}

let mail_GM_admin_3 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 대체 어떤 정보가 필요한걸까요?',
  content: '혹시 개발자를 모르겠나요?<br/><br/>EDF 검사기는 PTNP를 독보적 자리에 올려준 소프트웨어지요. 성능은 두말할 것도 없죠.<br/>그만큼 이 프로그램을 개발한 사람은 상당히 높은 위치에 있으시겠죠?<br/><br/>아니면 어떤 프로젝트인지 모르곘나요?<br/><br/>개발자는 분명 어떠한 신념을 가지고 EDF 시스템을 발전시켰을 거에요. 그 기반을 다져준 프로젝트가 있었을텐데… <br/>해당 프로젝트에 대해서 더 자세히 알아보고 싶으시다면 인터넷 검색을 해보면 도움이 되지 않을까요?<br/><br/>그것도 아니라면 버전을 모르시겠나요?<br/><br/>EDF 검사기의 버전 정보는 회사 홈페이지에 지속적으로 업데이트되고 있으니 참고해보면 좋겠네요.',
  attatch: []
}

let mail_GM_admin_4 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 숨겨진 비밀번호라구요?',
  content: '숨겨진 파일들을 찾아야 한다면… 누가 그런 장난을 치는 건지 모르겠지만 등잔 밑이 어둡다고, 문서들을 두는 기본 폴더들부터 확인해보는게 어떨까요?',
  attatch: []
}

let mail_GM_admin_5 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 이 이미지는 익숙하네요',
  content: '이건 회사 홈페이지에도 나오는 회사 로고네요.<br/>이게 어떻게 네트워크 폴더에 접근할 수 있는 열쇠가 되는 걸까요…?',
  attatch: []
}

let mail_GM_admin_6 = {
  sender: {
    name: 'GM',
    address: 'GovernmentManager@****.gov'
  },
  title: '[힌트] 숲에 나무가 정말 많군요',
  content: '열람할 수 있는 EDF 파일들이 많네요.<br/>물론 하나하나 다 열어볼 수도 있지만…<br/>처음은 회사에 반기를 든 자… 그 자를 찾아야 해요.',
  attatch: []
}